{
  "work": [
    {
      "title": "Data Analyst & Quality Assurance Specialist",
      "company": "PT Damar Gayatri Jaya (Medion Group)",
      "location": "Bandung Barat, Indonesia",
      "start_date": "02/2022",
      "end_date": "Current",
      "icon": "briefcase",
      "description": "Leading quality assurance initiatives in pharmaceutical manufacturing with focus on data-driven process improvement using Python, SQL, and Power BI.",
      "responsibilities": [
        "Executed qualification and validation of equipment and production processes to ensure compliance with pharmaceutical standards.",
        "Oversaw change control procedures by preparing and evaluating change documentation, minimizing risks to product quality.",
        "Conducted environmental monitoring of production areas, including temperature, humidity, and cleanliness.",
        "Managed process deviations through root cause analysis and corrective actions.",
        "Coordinated periodic calibration of measuring instruments, guaranteeing measurement accuracy.",
        "Led internal audits to assess adherence to standard operating procedures."
      ],
      "technical_contributions": [
        "Developed a machine learning model using Python (Scikit-learn) for predictive maintenance, increasing production uptime by 15%.",
        "Designed a Power BI dashboard for real-time quality metrics monitoring, reducing reporting time by 50% (from 2 days to 4 hours).",
        "Implemented a YOLO-based computer vision system for real-time product counting, achieving 98.5% accuracy and reducing inventory time by 75%.",
        "Automated QA reports with Python scripts, saving 10 hours of manual work weekly.",
        "Conducted microbiological data analysis using Python to ensure product compliance with quality standards, achieving a 98% compliance rate."
      ],
      "achievements": [
        "Reduced quality investigation time by 40% through implementation of standardized analysis templates",
        "Recognized for improved audit preparedness with zero critical observations in external audits",
        "Streamlined change control process, reducing average processing time by 30%",
        "Performed root cause analysis for process deviations, reducing defect rates by 10% through data-driven insights"
      ]
    },
    {
      "title": "Freelance Data Analyst",
      "company": "Self-Employed",
      "location": "Bandung, Indonesia",
      "start_date": "01/2022",
      "end_date": "12/2023",
      "icon": "laptop-code",
      "description": "Provided data analysis services to local businesses, focusing on marketing strategy optimization and sales forecasting.",
      "responsibilities": [
        "Analyzed sales data for local SMEs in Bandung using Python and Excel, delivering marketing strategy recommendations.",
        "Developed data visualizations to identify sales trends, enabling clients to make informed, data-driven decisions.",
        "Created interactive dashboards for easy data consumption by non-technical stakeholders."
      ],
      "technical_contributions": [
        "Analyzed sales data for 10+ retail and F&B SMEs using Python and Excel, driving 20% revenue growth through targeted marketing strategies.",
        "Created interactive data visualizations with Power BI to uncover sales trends, enabling data-driven decision-making for clients.",
        "Developed SQL queries to optimize inventory management for SME clients, reducing stock discrepancies by 15%."
      ],
      "achievements": [
        "Successfully increased client revenue by an average of 20% through data-driven recommendations",
        "Developed reusable analysis templates that reduced project turnaround time",
        "Built customized data processing pipelines using Python to handle diverse data sources"
      ]
    },
    {
      "title": "Customer Data Analyst & Consultant",
      "company": "PT Ruang Raya Indonesia (Ruangguru)",
      "location": "Jakarta, Indonesia",
      "start_date": "10/2021",
      "end_date": "12/2021",
      "icon": "briefcase",
      "description": "Analyzed consumer data to segment students and parents, improving targeted engagement strategies.",
      "responsibilities": [
        "Analyzed consumer data using CRM platforms to segment students and parents.",
        "Conducted follow-up on customer complaints, leveraging data insights to resolve issues.",
        "Provided data-driven consultation to students and parents, recommending tailored educational solutions."
      ],
      "technical_contributions": [
        "Analyzed consumer data using CRM platforms to segment students and parents, improving targeted engagement strategies by 25%.",
        "Conducted follow-up on customer complaints, leveraging data insights to resolve 90% of issues within 24 hours.",
        "Provided data-driven consultation to students and parents, recommending tailored educational solutions that increased enrollment conversions by 15%."
      ],
      "achievements": [
        "Improved targeted engagement strategies by 25% through customer segmentation",
        "Achieved 90% resolution rate for customer complaints within 24 hours",
        "Increased enrollment conversions by 15% through data-driven recommendations"
      ]
    },
    {
      "title": "Quality Assurance Intern",
      "company": "PT Perhutani Pine Chemical Industry",
      "location": "Pemalang, Indonesia",
      "start_date": "06/2020",
      "end_date": "08/2020",
      "icon": "flask",
      "description": "Assisted the quality control department in ensuring compliance with quality standards for chemical products.",
      "responsibilities": [
        "Analyzed chemical production processes to ensure compliance with industry standards.",
        "Assisted in quality testing and documentation, contributing to improvements in production workflows.",
        "Conducted performance tests under various conditions to assess stability and responsiveness of products."
      ],
      "technical_contributions": [
        "Analyzed production data to ensure compliance with quality standards, identifying 5 critical risks that improved process reliability.",
        "Created Excel-based reports to track production quality metrics, streamlining compliance documentation."
      ],
      "achievements": [
        "Identified 5 critical quality risk factors in the production process",
        "Received commendation for detailed documentation and recommendation report",
        "Developed Excel templates for quality data tracking and analysis"
      ]
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Engineering",
      "field": "Chemical Engineering",
      "institution": "Universitas Ahmad Dahlan",
      "location": "Yogyakarta, Indonesia",
      "graduation_date": "10/2021",
      "icon": "graduation-cap",
      "gpa": "3.47/4.00",
      "honors": "CumLaude",
      "relevant_coursework": [
        "Statistical Process Control",
        "Data Analytics",
        "Process Simulation",
        "Numerical Methods",
        "Quality Control",
        "Process Design"
      ],
      "thesis": {
        "title": "Preliminary Plant Design Dimethyl Phthalate From Phtalic Anhydride And Methanol With Capacity Of 60.000 Tons/Years",
        "description": "Applied statistical methods to identify critical process parameters affecting product quality in chemical manufacturing."
      }
    }
  ]
}